#pragma once
#include <string>
using namespace std;

class CLekasrtvo
{
  private:
  string ime; // Име на лекарство
  string kat_nomer; // Каталожен номер на лекарство
  string razfasovka; // вид разфасовка (ампули, блистери, дражета, таблетки, пакети... )
  float cena; // Дисциплина по която преподава
  int kolichestvo; // Трудов стаж


  public:
    CLekasrtvo();
    CLekasrtvo(string, string, string, float, int);
    int operator>(CLekasrtvo); // Предефиниране на операцията >
    void Add(); // Метод за добавяне на нов учител
    void Print();  // Метод за отпечатване на информацията за избран учител
    string Ime() { return ime; }
    // string Disciplina() { return disciplina; }
    // long int EGN() { return egn; }
};

// Да се напише програма на С++, която обработва данни за лекарствата в една аптека и:
// 1. Дефинира клас, съдържащ минимум следните данни:
// наименование на лекарството; каталожен номер; вид разфасовка (ампули, блистери, дражета, таблетки, пакети... ); единична цена; налично количество и минимум следните методи:
// - 2 конструктора (един по подразбиране и един с параметри);
// - метод за отпечатване на информацията на обект от този клас.
// - метод за предефиниране на операцията ‘>’ (сравнението е по цена на лекарството);

// 2. Дефинира клас, който съдържа минимум следните данни:
// име на аптека; масив, чиито елементи са  обекти на предишния клас (размерът на масива се променя динамично).
// Класът да притежава минимум следните методи:
// - 2 конструктора (един по подразбиране и един с параметри) и един деструктор;
// - метод по желание;
// - метод за отпечатване съдържанието на масива;
// - метод за добавяне данните на ново лекарство;
// - метод за изтриване (по каталожен номер)  данните за  лекарство;
// - по въведен каталожен номер отпечатва данните за съответното лекарство;
// - по въведена цена отпечатва всички лекарства, които са по-евтини от нея;
// - по въведено наименование на лекарство отпечатва кат. номер на най-евтината разфасовка от него (използвайте предеф. операция ‘>’).

