#pragma once
#include <string>
using namespace std;

class Polet
{
  private:
    int polet_nomer;
    string samolet;
    string napravlenie;
    float vreme_na_polet;
    string chas_izlitane;
    string ime_na_letishte;

  public:
    Polet(); //конструктор по подразбиране
    Polet(int, string, string, float, string, string); //конструктор с параметри
    void Add(); //добавя
    void Print(); //отпечатва
};


// Задача 2. Да се напише програма на С++, която обработва данни за линиите на една авиокомпания и:

// 1. Дефинира клас, съдържащ минимум следните данни:
// номер на полета; вид на самолета; направление; продължителност на полета; час на излитане; име на летище и минимум следните методи:
// - 2 конструктора (един по подразбиране и един с параметри);
// - метод за отпечатване на информацията на обект от този клас.

// 2. Дефинира клас, който съдържа минимум следните данни:
// име на авиокомпания; масив, чиито елементи са  обекти на предишния клас (размерът на масива се променя динамично).
// Класът да притежава минимум следните методи:
// - 2 конструктора (един по подразбиране и един с параметри) и един деструктор;
// - метод за отпечатване съдържанието на масива;
// - по номер на полет извежда всички данни;
// - по въведено летище и направление отпечатва данните за най-късния полет.

// 3. Дефинира main() функция, която тества по подходящ начин методите за поне 2 авиокомпании.
