#pragma once
#include <string>
using namespace std;

class CKola
{
  private:
    string marka; //марка на колата
    string cvqt;//цвят на колата
    string reg_nomer;//регистрационен номенр на колата
    int godina; //година на производство
    string sobstvenik;//собственик на колата


//марка, цвят, регистрационен номер, година на производство, име на собственик

  public:
    CKola();
    CKola(string, string, string, int, string);
    int GetGodina() { return godina; };
    string GetRegNomer() { return reg_nomer; }
    string GetMarka() { return marka; }
    string GetCvqt() { return cvqt; }
    string GetSobstvenik() { return sobstvenik; }
    int operator<(CKola); //предефиниране на оператор <
    void Add(); //добавяне на нов лекар
    void Print(); //отпечатване на лекар
};


  // Да се напише програма на С++, която обработва данни за автомобилите в едно подразделение на КАТ и:
  // 1. Дефинира клас, съдържащ минимум следните данни за автомобил:  марка, цвят, регистрационен номер, година на производство, име на собственик и  следните методи:
  // - 2 конструктора (един по подразбиране и един с параметри);
  // - метод за отпечатване на информацията на обект от този клас.
  // - метод за предефиниране на операцията < (сравнението е според възрастта на автомобила).

  // 2. Дефинира клас, който съдържа минимум следните данни за КАТ:
  // име на поделението на КАТ, брой автомобили; масив, чиито елементи са  обекти на предишния клас (размерът на масива се променя динамично).
  // Класът да притежава минимум следните методи:
  // - 2 конструктора (един по подразбиране и един с параметри) и един деструктор;
  // -  метод по желание;
  // - по регистрационен номер отпечатва данните на автомобила;
  // - метод за отпечатване съдържанието на масива;
  // - добавяне на автомобил към поделението на КАТ;
  // - метод за изтриване  на автомобил по регистрационен номер;
  // - метод за отпечатване на всички коли на даден собственик.
  // - по дадена марка и цвят отпечатва най-стария автомобил; (използвайте пред. операция ‘<’)

  // 3. Дефинира main() функция, която чрез меню тества методите на втория клас.

