#pragma once
#include <string>
using namespace std;

class CAnimal
{
  private:
    string reg_number; // регистрационен номер на животното
    string name; // име на животното
    int age; // въззраст на животното
    int sex; // пол на животното
    string kind; // вид животно
    int food_type; // вид храна
    float food_amount; // количество храна

  public:
    CAnimal();
    CAnimal(string, string, int, int, string, int, float);
    int operator>(CAnimal); //предефиниране на оператор <
    void Add(); //добавяне на ново животно
    void Print(); //отпечатване на животно
    string GetRegNomer() { return reg_number; }
    string GetName() { return name; }
    int GetAge() { return age; }
    int GetSex() { return sex; }
    string GetKind() { return kind; }
    int GetFoodType() { return food_type; }
    int GetFoddAmount() {return food_amount; }
};



// Да се напише програма на С++, която обработва данни за животните от една зоологическа градина и:
// 1. Дефинира клас, съдържащ минимум следните данни:
// регистрационен номер, име на животното, възраст, пол, вид,вид храна - растителна или животинска и количество храна, необходимо на животното за един ден;
// и  следните методи:
// - 2 конструктора (един по подразбиране и един с параметри);
// - метод за отпечатване на информацията на обект от този клас.
// - метод за предефиниране на операцията > (сравнението е според възрастта на животните).
// 2. Дефинира клас, който съдържа минимум следните данни:
// име на зоологическата градина, брой животни; масив, чиито елементи са  обекти на предишния клас (размерът на масива се променя динамично).
// Класът да притежава минимум следните методи:
// -	2 конструктора (един по подразбиране и един с параметри) и един деструктор;
// -	метод по желание;
// -	метод за отпечатване съдържанието на масива;
// -	добавяне на ново животно;
// -	по регистрационен номер изтрива животно от масива.
// -	метод, който по по даден животински вид отпечатва имената и възрастта на всички животни от този вид;
// -	метод, който по по даден животински вид отпечатва данните на най-възрастното животно от този вид.
//  (използвайте предеф. операция ‘>’)
