#pragma once
#include <string>
using namespace std;

class CPerson
{
  private:
  unsigned reg_id; // Регистрационен номер;
  string name; // Име
  long long personal_id; // ЕГН
  unsigned sex; // Пол
  unsigned age; // Възраст
  float weight; // Тегло
  string profession; // Професия
  string hobby; // Хоби

  public:
    CPerson();
    CPerson(unsigned, string, long long, unsigned, unsigned, float, string, string);
    long long GetPersonalID() { return personal_id; };
    // int GetGrade() { return grade; }
    // string GetSection() { return section; }
    // int GetNumber() { return number; }
    // int GetAge() { return age; }
    // int GetWeight() { return weight; }
    int operator<(CPerson); // Предефиниране на оператор >
    void Add(); // Mетод за добавяне на нов ученик
    void Print(); // Mетод за отпечатване на ученик
};




// Курсова работа №12
// Да се напише програма на С++, която обработва данни за клиентите в агенция за запознанства и:
// 1. Дефинира клас, съдържащ минимум следните данни:
// регистрационен номер; име; ЕГН, пол; възраст; тегло; професия; хоби  и минимум следните методи:
// - 2 конструктора (един по подразбиране и един с параметри);
// - метод за отпечатване на информацията на обект от този клас.
// - метод за предефиниране на операцията ‘<’ (сравнението е по възраст);

// 2. Дефинира клас, който съдържа минимум следните данни:
// име на агенция; масив, чиито елементи са  обекти на предишния клас (размерът на масива се променя динамично).
// Класът да притежава минимум следните методи:
// - 2 конструктора (един по подразбиране и един с параметри) и един деструктор;
// - метод по желание;
// - метод за отпечатване съдържанието на масива;
// - метод за добавяне данните на нов  клиент в агенцията.;
// - метод за изтриване (по ЕГН)  данните на клиент;
// - по въведен рег. номер отпечатва всички данни за клиента;
// - по въведена професия отпечатва всички клиенти, които я практикуват;
// - по въведен пол, тегло и професия отпечатва най-младия партньор със сходни качества (използвайте предеф. операция ‘<’).

// 3. Дефинира main() функция, която чрез меню тества методите на втория клас.
