#pragma once
#include <string>
using namespace std;

class CSoftware
{
  private:
    string product_name;
    string manufacturer;
    int size;
    float price;
    int total_salse;

  public:
    CSoftware();
    CSoftware(string, string, int, float, int);
    string GetProductName() { return product_name; }
    string GetМanufacturer() { return manufacturer; }
    int GetSize() { return size; }
    float GetPrice() { return price; }
    int GetTotalSalse() { return total_salse; }
    void Add();
    void Print();
};

// Изпит (ООП, IКИ/зад. Вариант-15)

// Задача 2.
// Да се напише програма на С++, която обработва данни за програмни продукти, продавани от една фирма и:

// 1. Дефинира клас, съдържащ минимум следните данни:
// име на софтуерния продукт, име на фирмата производител, размер в мегабайти,  цена и брой продажби;
//  и  следните методи:
// - 2 конструктора (един по подразбиране и един с параметри);
// - метод за отпечатване на информацията на обект от този клас.

// 2. Дефинира клас, който съдържа минимум следните данни:
// име на фирмата, брой програмни продукти; масив, чиито елементи са  обекти на предишния клас (размерът на масива се променя динамично).
// Класът да притежава минимум следните методи:
// -	2 конструктора (един по подразбиране и един с параметри) и един деструктор;
// -	метод за отпечатване съдържанието на масива;
// -	метод, който по дадено обем в мегабайти отпечатва имената на всички програмни продукти с обем по-голям от зададения;
// -	метод, който по дадена фирма производител отпечатва оборота от продадените нейни програмни продукти.

// 3. Дефинира main() функция, която тества по подходящ начин методите за поне 1 фирма.


// ------------------------------------------------------------------------------------------------------------


// Задача 1.
// •	Създайте клас, с който се описва артикула – лаптоп, със следните данни: марка, вид на процесора (напр. Intel, AMD), мощност на батерията (W/h), капацитет на RAM паметта (гигабайти), размер на дисковото пространство (терабайти), външна видеокарта („Да“, „Не“), тегло (грамове), срок на годност, цена.
// Класът да разполага с методи за въвеждане, конструктори, отпечатване, с методи за предефиниране на операциите > ( сравнението е според цената), >> и <<.
// •	Напишете главна main() функция, в която се тестват методите на класа.





